<?php
/**
 * Created by PhpStorm.
 * Author: zjh
 * Date: 2017-8-7 007
 * Time: 15:43
 */

namespace app\command;
use app\common\service\JoinService;
use think\console\Input;
use think\console\Output;
use think\console\input\Argument;

class MakeData extends \think\console\Command
{
	function configure()
	{
		$this->setName('make_data')->setDescription('move file from hard to oss');
		$this->addArgument('args', Argument::OPTIONAL);
	}

	private function makePhone(){
		$second = [3,5,7,8];
		$third = range(0,9);

		shuffle($second);
		shuffle($third);

		return 1 . $second[0] . join('',array_slice($third,0,9));
	}

	private function genBargain(){
		dump($this->makePhone());
	}

	function execute(Input $input, Output $output){
		$args = $input->getArguments()['args'];
		$args = empty($args) ? 'help' : $args;

		switch($args){
			case 'bargain':
				$this->genBargain();
				break;
			case 'help':
				$output->writeln('php think make_data bargain');
				break;
			default:
				$output->writeln('You input wring arguments');
				break;
		}
	}

	private function makeName(){
		$first_name = '赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯';
		$last_name = '李思聪,李蒙雨,李骏桀,李飞星,李文宣,李芮雅,李慧丽,李菀菀,李诗晗,李淑华,李怜晴,李芷波,李可心,李千易,李德润,李沛容,李其雨,李琴心,李盼兰,李善静,李丹南,李南珍,李念瑶,李飞荷,李欣德,李韫素,李思雁,李怡璐,李白梅,李鸿云,李乐悦,李静和,李芳春,李晓楠,李姣姣,李易蓉,李立诚,李梦凡,李谷之,李恨蝶,李亦凝,李彤霞,李晶瑶,李安然,李鸿波,李燕楠,李从安,李弘和,李曼语,李宛亦,李雯君,李黎昕,李晨潍,李泽惠,李书南,李星鹏,李俊楠,李冰真,李明珠,李凌青,李寄柔,李芳洲,李惜筠,李仙媛,李一南,李嘉禧,李雨石,李和裕,李辰钊,李碧琴,李烨熠,李江雪,李飞昂,李新梅,李思云,李骞泽,李醉柳,李迎曼,李合瑞,李孤晴,李俊迈,李谷菱,李善思,李君昊,李凌青,李咏德,李苇然,李桃雨,李茂材,李霞绮,李芷烟,李凝阳,李流丽,李芳芳,李初夏,李德泽,李永福,李文君,李芳蔼,李颖慧,李怀蕾,李秀娟,李霞赩,李向卉,李宜楠,李彩静,李香露,李雅楠,李清漪,李谷翠,李清晖,李伟茂,李湛芳,李芳泽,李元槐,李若菱,李乐游,李鸿文,李哲彦,李怜云,李绿兰,李天曼,李凝丹,李霞雰,李浩穰,李怀玉,李俊语,李又亦,李昌黎,李宛秋,李子美,李雪曼,李南烟,李紫文,李寒梦,李芳洁,李元思,李雪卉,李雅容,李高旻,李欣畅,李星爵,李杏儿,李雨华,李立轩,李良畴,李靖之,李项禹,李天悦,李雯华,李易巧,李曾琪,李问雁,李悦爱,李慕梅,李静婉,李惜文,李雨琴,李妙芙,李听云,李怀柔,李云臻,李伶俐,李雁荷,李寄蓝,李雪珍,李娴雅,李英彦,李初兰,李如云,李华皓,李翠霜,李雨筠,李云岚,李牧歌,李涵梅,李英毅,李清舒,李雅洁,李俊悟,李忆丹,李丽佳,李清心,李玉堂,李月明,李宏硕,李婷秀,李飞珍,李傲云,李怜容,李宏阔,李圣杰,李宾鸿,李虹英,李微澜,李俏美,李博简,李傲薇,李冷雁,李鸿才,李文惠,李春英,李博文,李华楚,李飞莲,李力学,李尔容,李采蓝,李淑雅,李文敏,李华月,李昭君,李炎彬,李成业,李乐英,李振锐,李秋双,李成天,李慧月,李觅柔,李奇水,李春芳,李秀艳,李谷芹,李宜嘉,李名姝,李幻巧,李新瑶,李亦玉,李高邈,李向真,李丹丹,李嘉悦,李霞飞,李可可,李寄云,李昆雄,李古香,李奥雅,李德业,李琬凝,李芳蕤,李梓涵,李含雁,李书雁,李昆宇,李曲静,李银河,李问风,李诗筠,李芙蓉,李妍丽,李冷荷,李如仪,李靖琪,李乐怡,李雪风,李尔安,李寄容,李秀英,李允晨,李文思,李芷云,李恬静,李乐安,李映天,李问薇,李妙思,李醉巧,李安阳,李碧蓉,李曼青,李代巧,李知慧,李嘉德,李天韵,李悦怡,李睿思,李睿德,李彦灵,李妍歌,李经纬,李兴安,李小之,李玉宇,李明杰,李之云,李雁芙,李兴学,李怡和,李宜年,李文彦,李修美,李歌韵,李冬雁,李幼安,李安露,李凡白,李绮艳,李凡白,李念梦,李愉婉,李梓琬,李奇思,李梦桐,李阳飇,李志尚,李昊空,李盼夏,李白薇,李令燕,李采萱,李顺慈,李初南,李成龙,李自强,李嘉音,李韵诗,李辰沛,李芷蝶,李凯乐,李娅欣,李灵萱,李贞怡,李良奥,李忆彤,李英发,李雨晨,李凝海,李正真,李晶滢,李寄灵,李天空,李梧桐,李安筠,李景平,李星波,李海桃,李丹亦,李德惠,李梦菲,李庄丽,李奇略,李古韵,李以旋,李燕岚,李雨梅,李觅翠,李鹏鲸,李艳芳,李范明,李涵煦,李盼秋,李凌晴,李红英,李芮欢,李清妍,李致欣,李飞烟,李平和,李山梅,李书慧,李宏胜,李德明,李和璧,李静竹,李易梦,李凝荷,李清昶,李兰若,李孤松,李凯凯,李佩玉,李香旋,李宏浚,李林楠,李惠然,李平卉,李沛柔,李依楠,李成礼,李子轩,李文茵,李以彤,李幻桃,李映寒,李振翱,李思彤,李艳卉,李宏放,李子萱,李皓月,李靖柏,李秋蝶,李智勇,李思雅,李盈盈,李正卿,李雅畅,李一雯,李向薇,李清舒,李恨桃,李紫安,李思博,李和泽,李晴岚,李瀚钰,李秀兰,李鸿晖,李耘豪,李秀竹,李醉山,李山槐,李乐圣,李思萌,李寄蓉,李忆安,李曼妮,李星海,李和暖,李琳晨,李又莲,李白亦,李桂帆,李鸿飞,李凌波,李清韵,李寻梅,李光亮,李忆文,李诗珊,李晓燕,李巧春,李和玉,李博涉,李诗蕊,李峻熙,李又绿,李向雁,李瑜蓓,李和豫,李雨彤,李梓玥,李雅彤,李诗珊,李子明,李寅骏,李青文,李丹蝶,李英睿,李香柏,李轩秀,李水蓝,李小谷,李鸿博,李寻菡,李阳曦,李琛瑞,李盼波,李山雁,李布凡,李凝丝,李春雪,李白山,李仙韵,李兴贤,李知睿,李秀艳,李冷松,李寒松,李安容,李浩然,李娟巧,李盼旋,李英韶,李敏博,李芷烟,李半梅,李傲安,李从蕾,李柔谨,李宛白,李暖暖,李佳悦,李思松,李清霁,李沈思,李雅香,李香莲,李怀梦,李绿夏,李霞辉,李曼青,李雪枫,李依凝,李嘉宝,李雪容,李寄蕾,李斯雅,李欢悦,李丽珠,李白容,李傲之,李尔冬,李泰平,李建树,李以莲,李昌淼,李英媛,李翠绿,李雪兰,李依柔,李初兰,李贞芳,李永寿,李骊文,李梦之,李小琴,李觅露,李悠柔,李冰心,李鸿畅,李昆纶,李浩旷,李忆安,李溪澈,李云逸,李曦之,李智杰,李暖姝,李孤容,李依白,李天菱,李彦露,李寄南,李慕雁,李含灵,李修筠,李恨风,李曼凡,李运馨,李青易,李如之,李易蓉,李绿柳,李鹏天,李学博,李宛凝,李紫菱,李吉欣,李优悦,李瀚彭,李妍雅,李怜南,李正德,李青旋,李易绿,李承教,李怀雁,李修然,李妙双,李致远,李白凝,李攸然,李寄翠,李珠佩,李运华,李吉玟,李霞姝,李兰泽,李逸仙,李紫萍,李晗晗,李华茂,李香桃,李敏思,李雪卉,李凝静,李志勇,李晓莉,李惜玉,李晓山,李芷若,李景浩,李山彤,李青枫,李映阳,李彬彬,李夏兰,李元瑶,李初南,李采绿,李凝芙,李雨晴,李怀莲,李乐双,李寒烟,李华翰,李正雅,李冷之,李淑君,李慕蕊,李西华,李宵晨,李德庸,李春翠,李语山,李驰文,李友卉,李念文,李灵秀,李碧曼,李晓博,李海昌,李赫然,李俊雅,李悠雅,李夏容,李月桂,李华采,李慧秀,李晨璐,李天薇,李依薇,李辰龙,李春兰,李嘉运,李春英,李晓瑶,李雨灵,李秀媛,李雪珊,李长逸,李昕葳,李天欣,李天瑞,李沈靖,李梦槐,李蔚星,李虹颖,李雁桃,李悦喜,李美华,李月灵,李舒怀,李访冬,李德辉,李莎莎,李骏俊,李紫蕙,李旭辉,李昊磊,李若云,李嫣然,李海白,李丽姿,李忆之,李修能,李清佳,李星菱,李雪晴,李思若,李萌运,李尔蝶,李海女,李雅寒,李丹亦,李孤丹,李天蓝,李献玉,李碧琳,李浩广,李春燕,李诗翠,李弘大,李雅柏,李迎夏,李春晓,李妮娜,李涵易,李隽雅,李经业,李凝安,李清妙,李睿诚,李念露,李勇毅,李兰蕙,李寻芳,李阳曦,李妍晨,李畅畅,李易槐,李温韦,李婉然,李以蕊,李任真,李雪卉,李采春,李悦来,李倚云,李浩初,李香露,李芳蔼,李天韵,李幼枫,李妞妞,李静槐,李鸿博,李宏博,李伟毅,李运良,李浩岚,李方方,李尔云,李流逸,李信鸥,李凝冬,李叶飞,李晓慧,李正阳,李雨文,李沛白,李平晓,李逸美,李博丽,李乐邦,李飞薇,李浩淼,李谷梦,李嘉玉,李香菱,李如松,李文心,李德曜,李傲南,李涵易,李欣彩,李弘量,李敏叡,李傲冬,李玛丽,李景辉,李鸿羽,李易巧,李初翠,李凌春,李飞阳,李欣怡,李念双,李茹云,李子琪,李曼丽,李绍祺,李建义,李优乐,李曼云,李卓然,李夏云,李暄莹,李春岚,李冬萱,李烨赫,李香卉,李灵萱,李天玉,李飞宇,李秀敏,李静安,李奇胜,李昊伟,李开诚,李天亦,李清馨,李琬凝,李依白,李语彤,李听云,李心慈,李翠琴,李秋珊,李冬莲,李俊明,李子真,李忆安,李乐心,李幻儿,李阳波,李傲安,李吉玉,李听南,李悦心,李吟怀,李星渊,李暄和,李笑萍,李明喆,李英逸,李沛柔,李骊英,李琇云,李丹彤,李静晨,李清昶,李修竹,李晓山,李平雅,李春蕾,李森丽,李柔蔓,李从珊,李逸雅,李宛秋,李凡巧,李秋阳,李米雪,李海蓝,李代桃,李施诗,李宛筠,李星然,李素欣,李若骞,李思茵,李家馨,李之桃,李平婉,李雪枫,李秋月,李英华,李倩美,李安寒,李冷荷,李昭昭,李访文,李迎海,李念天真,李懿轩,李嫚儿,李骊霞,李乐儿,李晨星,李格格,李语蝶,李乐池,李小凝,李问薇,李景同,李巧香,李孤菱,李子民,李涵蓄,李睿敏,李春雪,李凌青,李绣文,李慧俊,李兴邦,李心语,李从凝,李怡然,李博赡,李从阳,李信然,李骏奇,李痴旋,李晓灵,李南莲,李立群,李弘雅,李思烟,李绮梅,李沛容,李麦冬,李飞鹏,李春晓,李浩壤,李从露,李锦文,李沛凝,李以珊,李和洽,李冬梅,李德馨,李鸿祯,李珍瑞,李秀慧,李尔容';

		$first = rand(0,mb_strlen($first_name,'utf-8') - 1);
		$list = explode(',',$last_name);
		$last = $list[array_rand($list)];

		return mb_substr($first_name,$first,1,'utf-8') . mb_substr($last,1,2,'utf-8');
	}
}